Public Member Functions | Friends | List of all members
ACAPI::MEP::ElbowUIManager Class Referencefinal
MEP Element Manager
The ElbowUIManager contains UI-related services for an Elbow. More...
#include <MEPElbowUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::ElbowUIManager:
 Public Member Functions
Result< ElbowDefault >  | CreateElbowDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates an ElbowDefault from a toolUIData.
Result< void >  | ApplyElbowDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const ElbowDefault &elbowDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< ElbowUIManager >  | CreateElbowUIManager ()
Creates an ElbowUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The ElbowUIManager contains UI-related services for an Elbow.
Since
Archicad 28
Member Function Documentation
◆ ApplyElbowDefaultToToolUIData()
 Result< void > ACAPI::MEP::ElbowUIManager::ApplyElbowDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const ElbowDefault & |  elbowDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
elbowDefault | The default to be set
Returns
Returns error if the ElbowDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateElbowDefaultFromToolUIData()
 Result< ElbowDefault > ACAPI::MEP::ElbowUIManager::CreateElbowDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates an ElbowDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Elbow in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an ElbowDefault, otherwise returns the ElbowDefault created from it.
Friends And Related Symbol Documentation
◆ CreateElbowUIManager
 Result< ElbowUIManager > CreateElbowUIManager  |  ( |   | )
friend
Creates an ElbowUIManager.
Returns
If able, creates a new manager for Elbow, otherwise Error.